"""
============================
Author:柠檬班-木森
Time:2020/2/8   9:53
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
格式化输出：
1、format格式化输出（掌握）

2、传统的%号，格式化输出：%f,%d
%s:万能的占位符：可以给它传任意类型的数据
%f:数值占位符，以小数的形式显示
%d:数值占位符，以整数的形式显示

3、F表达式格式化输出:

"""

#
# print("今天收到张三，交来学费500.开此收据为凭证")
# print("今天收到李四，交来学费500.开此收据为凭证")
# print("今天收到王五，交来学费500.开此收据为凭证")
# print("今天收到木森，交来学费500.开此收据为凭证")

# 如何在字符串中预留位置，插入数据
# s1 = "今天收到XXX，交来XXX,XXX.开此收据为凭证"

# 第一种：format
# s2 = "今天收到{}，交来{}{}.开此收据为凭证"
# ss = s2.format("纸巾", "书本费", 6)
# print(ss)

# name = input("输入名字:")
# info = input("输入费用信息：")
# money = input("输入金额：")
# print("今天收到{}，交来{}{}.开此收据为凭证".format(name, info, money))


# 传统的%号，格式化输出:%s,%f,%d
# s3 = "今天收到%s，交来%s,￥：%s,开此收据为凭证"
# s4 = s3 % ("张三", "学费", 888)
# print(s4)
# s3 = "今天收到%s，交来%s,￥：%f开此收据为凭证" % ("张三", "学费", 888)
# s3 = "今天收到%s，交来%s,￥：%d开此收据为凭证" % ("张三", "学费", '888')
# s3 = "今天收到%s，交来%s,￥：%s开此收据为凭证" % ("张三", "学费", 888.8)
# print(s3)
# 限制小数的显示位数:
# s3 = "今天收到%s，交来%s,￥：%.4f开此收据为凭证" % ("张三", "学费", 888.9999)
# print(s3)

# F表达式(扩展)
# name = input("输入名字:")
# info = input("输入费用信息：")
# money = input("输入金额：")
# print("今天收到{}，交来{}{}.开此收据为凭证".format(name, info, money))
# s1 = F"今天收到{name}，交来{info},{money}.开此收据为凭证"
# print(s1)
